app/controllers/stocks_controller.rb

  def index
    @stocks = Stock.all.includes(:market_price, :bearer)
---
SELECT "bearers".* FROM "bearers" WHERE "bearers"."id" IN (1, 2, 3)
SELECT "market_prices".* FROM "market_prices" WHERE "market_prices"."id" IN (1, 3)
SELECT "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL

  def show
    @stock = Stock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL AND "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @stock = Stock.new(stock_params)
    if @stock.save
---
INSERT INTO "stocks" ("name", "bearer_id", "market_price_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "cool"], ["bearer_id", 4], ["market_price_id", 4], ["created_at", "2017-07-10 13:07:26.366909"], ["updated_at", "2017-07-10 13:07:26.366909"]]

  def update
    @stock = Stock.find(params[:id])
    if @stock.update(stock_params)
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL AND "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "stocks" SET "market_price_id" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["market_price_id", nil], ["updated_at", "2017-07-09 18:26:03.926259"], ["id", 1]]

  def destroy
    @stock = Stock.find(params[:id])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."deleted_at" IS NULL AND "stocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]